import React, { useState, useEffect } from 'react'
import './about.css'
import Menu from '../component/menu'; 

export default function About() {

    const [currentPage, setCurrentPage] = useState(0);
    const numberOfPages = 3;

    function pageComponent(pageIndex) {
        if (pageIndex === 0)
            return <Img1 />
        else if (pageIndex === 1)
            return <Img2 />
        else if (pageIndex === 2)
            return <Img3 />


    }


    return (
        <>
                <Menu />
            <div className="app ">
                <h1 className={"aboutName"}>אודות</h1>

                <button
                    disabled={currentPage === 0}
                    onClick={(e) => setCurrentPage(v => v - 1)}
                >&lt; הדף הקודם
                </button>

                <button
                    disabled={currentPage >= numberOfPages - 1}
                    onClick={(e) => setCurrentPage(v => v + 1)}
                >הדף הבא &gt;</button>
                {pageComponent(currentPage)}

            </div>

        </>
    );
}

export function Img1() {
    return (
        <>

            <div className="aboutPage col-12">

                <h3 className={"titleCh"}>היסטוריית החנות</h3>
                <h6 className={"titleCh1 col-11"}>
                    לפני 10 שנים החלטנו להציע משהו חדש ושונה לקהל ההורים והקמנו
                    חנות קטנה בתל אביב בקונספט של השכרה- <br></br>
                    קונים עגלה חדשה  ומשלמים פר חודש. לאחר מכן פתחנו מחלקת עגלות
                    יד שנייה, של עגלות באיכות טובה, אחרי ניקוי ותחזוקה.<br></br>
                    משם התפתחנו למסלול טרייד אין ועוד...<br></br>

                    כיום עם הוזלת מחירי העגלות ירד הביקוש לעגלות יד שנייה ומסלולי
                    טרייד אין ויצאנו לדרך חדשה בה הפכנו מחנות קטנה במרכז לרשת

                    בפריסה ארצית, עם סניפים גדולים,  צוותים מקצועיים ומגוון עצום של מוצרים.
                    והכל זמין ומהיר באתר , לרשותכם...
                </h6>
            </div>
        </>
    )
}
export function Img2() {
    return (
        <div className="aboutPage col-12">
            <h3 className={"titleCh"}> הסיבות שגרמו לפתיחת החנות</h3>
            <h6 className={"titleCh1 col-11"}>
                אם בעוד מספר שבועות יגיח לעולם התינוק החדש שלכם, שוודאי חיכיתם לו זמן רב, זה הזמן להיערך לקראת הגעתו
                ולהצטייד בכל המוצרים הנדרשים לתינוק.<br></br>
                ישנן לא מעט חנויות המרכזות תחת קורת גג אחת
                מבחר של אפשרויות שמהן ניתן לבחור ובטווח מחירים רחב מאד.<br></br>
                המוצרים השונים
                שבהם יש להצטייד לפני הגעתו של התינוק הם: עגלות, מושבי בטיחות לרכב, מיטת תינוק ומצעים מתאימים לה,<br></br>
                בגדי תינוקות,
                שידת החתלה, בקבוקים, מוצצים וכמובן צעצועים שונים המתאימות לתינוקות הקטנים..<br></br>
                תיקי החתלה יכולים לשמש הורים רבים
                ולהיות פתרון נהדר וגם מנשאים המאפשרים לקחת את התינוק לכל מקום ומבלי הסרבול של העגלה הגדולה.
                <br></br>
                הערכות נכונה ופנייה אל
                חנויות המתמחות בכך תעזור לכם להתארגן לקראת הגעתו של התינוק החדש, ובעיקר תאפשר לכם ליהנות ממוצרים שילוו
                אתכם זמן רב ובביטחון מלא.
            </h6>
        </div>
    )
}
export function Img3() {
    return (

        <div className="aboutPage col-12">
            <h3 className={"titleCh"}> מצב החנות עכשיו</h3>
            <h6 className={"titleCh1 col-11"}>
                בMY BABY אנו מובילים מכירה ישירות מהיבואן של המותגים הכי אהובים בעולם- לצרכן,
                <br></br>
                ובכך מציעים לכם מחירים משתלמים ומגוון עצום.
                <br></br>


                מאחורי ההצלחה הזאת – נמצאים אתם, הקהל היקר שלנו שבוחר בנו כל פעם מחדש, כשהסיבות לכך הן רבות.



                הערך החשוב ביותר שמוביל אותנו הוא השירות ללקוחות שלנו, <br></br>
                כאשר טובת הלקוח תמיד לנגד עינינו.
                אנו משקיעים מאמצים רבים בהפעלת צוות איכותי, מקצועי ואנושי, שזמין לכם בכל המדיות<br></br>
                , לכל שאלה ובקשה.<br></br>

                מלבד השירות , תמצאו אצלנו מחירים הוגנים,
                שלל מותגים מובילים בעולם, מוצרים איכותיים ומבוקשים, וכמובן מבצעים הכי משתלמים.

                באתר שלנו,    שמתעדכן מידי יום, תוכלו לבצע הזמנות ולקבל אותם במשלוחים מהירים במיוחד -
                לביתכם או לסניף<br></br>
                MY BABY הקרוב אליכם.
                <br></br> </h6>
        </div>

    )
}









